src/cf/src/DataProcessors/ПечатьЭтикеток/ПечатьЭтикеток.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПечатьЭтикеток</name>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаРозничная</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/cf/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыНоменклатуры</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <dimensions>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/НастройкиПользователей/НастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПользователей</name>
  <resources>
    <name>Значение</name>
    <comment>(Общ)</comment>
    <type>
      <types>Characteristic.ВидыНастроекПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыНастроекПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/DataProcessors/ПечатьЭтикеток/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПодборПоОСтаткам(Команда)
	ДанныеОтбора = Новый Структура("МестоХранения", ПредопределенноеЗначение("Справочник.МестаХранения.ПустаяСсылка")); 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДатаОстатков", ТекущаяДата());
	ПараметрыФормы.Вставить("МестоХранения", ДанныеОтбора.МестоХранения);
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораСерии", ЭтотОбъект);	
	ОткрытьФорму("Обработка.ПечатьЭтикеток.Форма.ВыборСерииПоОстаткам", ПараметрыФормы,,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыВыбораСерии(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда Возврат; КонецЕсли;
	Стр = Объект.ТЧТовары.Добавить();
	ЗаполнитьЗначенияСвойств(Стр,Результат);
	Стр.Штрихкод = ПолучитьШКНаСервере(Результат);
	Стр.ЦенаРозничная = ПолучитьРозничнуюЦенуНаСервере(Результат);
КонецПроцедуры

&НаСервере
Функция ПолучитьШКНаСервере(Результат)
	Возврат РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьШК(Результат.Номенклатура);
КонецФункции

&НаСервере
Функция ПолучитьРозничнуюЦенуНаСервере(Результат)
	Цена = 0;
	ТЗПоследнийПрайс = РегистрыСведений.ЦеныНоменклатуры.ПоследнийПрайс(ТекущаяДатаСеанса(), Справочники.ВидыЦен.Розничная,Результат.Номенклатура);
	Если Не ТЗПоследнийПрайс.Количество() = 0 Тогда 
		Цена = ТЗПоследнийПрайс.Получить(0).ЦЕна;
	КонецЕсли;
	Возврат Цена;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Док") Тогда
		Объект.ТЧТовары.Загрузить(Параметры.Док.ТЧТовары.Выгрузить());
		Для Каждого Стр из Объект.ТЧТовары Цикл 
			Стр.Штрихкод = ПолучитьШКНаСервере(Стр);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураПриИзменении(Элемент)
	Стр = Элементы.ТЧТовары.ТекущиеДанные;
	Структура = Новый Структура("Номенклатура,Серия",Стр.Номенклатура,Стр.Серия);
	Если Не Стр = Неопределено Тогда 
		Стр.Штрихкод = ПолучитьШКНаСервере(Структура);
		Стр.ЦенаРозничная = ПолучитьРозничнуюЦенуНаСервере(Структура);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСерияПриИзменении(Элемент)
	Стр = Элементы.ТЧТовары.ТекущиеДанные;
	Структура = Новый Структура("Номенклатура,Серия",Стр.Номенклатура,Стр.Серия);
	Если Не Стр = Неопределено Тогда 
		Стр.Штрихкод = ПолучитьШКНаСервере(Структура);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	Таб = Новый ТабличныйДокумент;
	ПредварительныйПросмотр = Ложь;
	Сформировать(Таб,ПредварительныйПросмотр);
	Если Таб = Ложь Тогда Возврат КонецЕсли;
	ВыводПечатныхФормКлиент.ВывестиСтикерыНаПринтер(Таб, 30, 10, 15, 50, ПредварительныйПросмотр);
КонецПроцедуры

&НаСервере
Функция Сформировать(Таб,ПредварительныйПросмотр)
	СформироватьСтикеры(Таб,ПредварительныйПросмотр);
	Таб.ИмяПринтера = ?(ЗначениеЗаполнено(Принтер),Принтер,РегистрыСведений.НастройкиПользователей.ПринтерЭтикеток());
	Возврат Таб;	
КонецФункции   

Функция СформироватьСтикеры(Таб,ПредварительныйПросмотр) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	///////////////////////
	// Выводим в таблицу //
	///////////////////////
	оШапка = Обработки.ПечатьЭтикеток.ПолучитьМакет("СтикерEAC").ПолучитьОбласть("Шапка|Колонка");
	Для Каждого Стр Из Объект.ТЧТовары Цикл
		Для А = 1 По Стр.Количество Цикл 
			оШапка.Параметры.Заполнить(Стр);
			Если Не Константы.ПечататьЦенуНаЭтикетке.Получить() Тогда 
				оШапка.Параметры.ЦенаРозничная = "";
			КонецЕсли;
			оШапка.Параметры.Артикул = Стр.Номенклатура.Артикул;
			оШапка.Параметры.Номенклатура = Стр.Номенклатура.Наименование 
				+ ?(ЗначениеЗаполнено(Стр.Номенклатура.Бренд), " "+Стр.Номенклатура.Бренд,"")
				+ ?(ЗначениеЗаполнено(Стр.Номенклатура.Качество), " "+Стр.Номенклатура.Качество,"");
			//FieldPhoto = ПараметрыСеанса.Пользователь.Организация.Логотип.Get();
			//Try
			//	оШапка.Рисунки.Лого = New Picture(FieldPhoto);
			//Except
			//EndTry;
			//оШапка.Параметры.Код = ОбщегоНазначенияКлиентСервер.УбратьЛидирующиеНули(Стр.Номенклатура.Код);
			//ПараметрыШтрихкода = ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
			//ПараметрыШтрихкода.Масштабировать     = Истина;
			//ПараметрыШтрихкода.СохранятьПропорции = Истина;
			//ПараметрыШтрихкода.ОтображатьТекст    = Ложь;
			//ПараметрыШтрихкода.Штрихкод = Стр.Штрихкод;
			//ПараметрыШтрихкода.ТипКода  = 16; //EAN13
			
			//QR	
			ПараметрыШтрихкода = ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
			ПараметрыШтрихкода.УровеньКоррекцииQR = 0;
			ПараметрыШтрихкода.Штрихкод = Стр.Штрихкод;
			ПараметрыШтрихкода.УбратьЛишнийФон = Истина;
			ПараметрыШтрихкода.ТипКода  = 16; //QR
			ПараметрыШтрихкода.Ширина = 40;
			ПараметрыШтрихкода.Высота = 40;
			
			Штрихкод = оШапка.Рисунки.QRcode;
			Штрихкод.РазмерКартинки = РазмерКартинки.Пропорционально;
			КоличествоСтрок = 2;
			
			Изображение = ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода);
			Если Изображение = Неопределено Тогда
				Штрихкод.Картинка = Новый Картинка;
			Иначе
				Штрихкод.Картинка = Изображение.Картинка;
			КонецЕсли;
			Штрихкод.ГраницаСверху = Ложь;
			Штрихкод.ГраницаСнизу  = Ложь;
			Штрихкод.ГраницаСправа = Ложь;
			Штрихкод.ГраницаСлева  = Ложь;
			
			//EAN13
			ПараметрыШтрихкода = ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
			ПараметрыШтрихкода.Штрихкод = Стр.Штрихкод;
			ПараметрыШтрихкода.УбратьЛишнийФон = Истина;
			ПараметрыШтрихкода.ТипКода  = 4; //EAN13
			ПараметрыШтрихкода.Ширина = 160;
			ПараметрыШтрихкода.Высота = 40;
			//ПараметрыШтрихкода.Масштабировать = Ложь;
			//ПараметрыШтрихкода.СохранятьПропорции = Истина;
			
			ШтрихкодEAN = оШапка.Рисунки.EAN13;
			ШтрихкодEAN.РазмерКартинки = РазмерКартинки.Растянуть;
			КоличествоСтрок = 2;
			
			ИзображениеEAN = ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода);
			Если ИзображениеEAN = Неопределено Тогда
				ШтрихкодEAN.Картинка = Новый Картинка;
			Иначе
				ШтрихкодEAN.Картинка = ИзображениеEAN.Картинка;
			КонецЕсли;
			ШтрихкодEAN.ГраницаСверху = Ложь;
			ШтрихкодEAN.ГраницаСнизу  = Ложь;
			ШтрихкодEAN.ГраницаСправа = Ложь;
			ШтрихкодEAN.ГраницаСлева  = Ложь;
			Таб.Вывести(оШапка);
			Если Не ПредварительныйПросмотр Тогда 
				Таб.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Таб.FitToPage = True;
	Таб.КоличествоЭкземпляров = 1;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОтображатьСетку = Ложь;
	Возврат Таб;
КонецФункции

&НаКлиенте
Процедура ПечатьСПросмотром(Команда)
	Таб = Новый ТабличныйДокумент;
	ПредварительныйПросмотр = Истина;
	Сформировать(Таб,Ложь);
	Если Таб = Ложь Тогда Возврат КонецЕсли;
	ВыводПечатныхФормКлиент.ВывестиСтикерыНаПринтер(Таб, 50, 20, 5, 50, ПредварительныйПросмотр);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СписокПринтеров = ВыводПечатныхФормКлиент.ПолучитьСписокПринтеров();
	Элементы.Принтер.СписокВыбора.ЗагрузитьЗначения(СписокПринтеров.ВыгрузитьЗначения());
	ПринтерПоУмолчанию = ПолучитьПринтерПользователяНаСервере();
	Если ЗначениеЗаполнено(ПринтерПоУмолчанию) Тогда
		Зн = СписокПринтеров.НайтиПоЗначению(ПринтерПоУмолчанию);
		Принтер = ?(Зн = Неопределено,"",Зн.Значение);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьПринтерПользователяНаСервере()
	Возврат РегистрыСведений.НастройкиПользователей.ПринтерЭтикеток();
КонецФункции
